HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/vpu_mvp_board_s.syscfg
adc3.$name                   = "myADCC";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc3.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc3.adcSignalMode           = "ADC_MODE_DIFFERENTIAL";
adc3.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc0Channel             = "ADC_CH_ADCIN2_ADCIN3";
adc3.soc0SampleWindow        = 96;
adc3.soc1SampleWindow        = 96;
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.enabledInts             = ["ADC_INT_NUMBER1"];
adc3.enableInterrupt1        = true;
adc3.interrupt1SOCSource     = "ADC_SOC_NUMBER1";
adc3.registerInterrupts      = ["1"];
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0Name                = "SKIIP2_CURRENT";
adc3.soc1Channel             = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc1Name                = "HALL1_CURRENT";
adc3.adcInt1.enableInterrupt = true;

adc4.adcBase                 = "ADCD_BASE";
adc4.$name                   = "myADCD";
adc4.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc4.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc4.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc4.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc4.soc0Channel             = "ADC_CH_ADCIN1";
adc4.soc0SampleWindow        = 96;
adc4.soc1Channel             = "ADC_CH_ADCIN8";
adc4.soc1SampleWindow        = 96;
adc4.soc2SampleWindow        = 96;
adc4.soc3SampleWindow        = 96;
adc4.soc3Channel             = "ADC_CH_ADCIN9";
adc4.soc4Channel             = "ADC_CH_ADCIN2";
adc4.soc4SampleWindow        = 96;
adc4.soc5Channel             = "ADC_CH_ADCIN9";
adc4.soc5SampleWindow        = 96;
adc4.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc4.enabledInts             = ["ADC_INT_NUMBER1"];
adc4.enableInterrupt1        = true;
adc4.registerInterrupts      = ["1"];
adc4.interrupt1SOCSource     = "ADC_SOC_NUMBER5";
adc4.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc5Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Name                = "VREFLOD_1";
adc4.soc0Name                = "SKIIP1_TEMP";
adc4.soc2Name                = "SKIIP2_TEMP";
adc4.soc3Name                = "VREFLOD_2";
adc4.soc4Name                = "SBC_MUXOUT";
adc4.soc5Name                = "VREFLOD_3";
adc4.adcInt1.enableInterrupt = true;

asysctl.enableTemperatureSensor = true;

can1.registerInterrupts      = true;
can1.interruptFlags          = ["CAN_INT_ERROR","CAN_INT_IE0","CAN_INT_STATUS"];
can1.interruptLine           = ["CAN_GLOBAL_INT_CANINT0"];
can1.$name                   = "CAN_SKIIP";
can1.enableInterrupt         = true;
can1.enableAutoBusOn         = true;
can1.AutoBusOnTimer          = 500000;
can1.msgObjsUsed             = [1];
can1.can.$assign             = "CANA";
can1.can.can_rxPin.$assign   = "GPIO62";
can1.can.can_txPin.$assign   = "GPIO63";
can1.can0Int.enableInterrupt = true;
can1.can1Int.enableInterrupt = true;
can1.msgObj1.$name           = "msgObj0";
can1.msgObj1.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj1.flags           = ["CAN_MSG_OBJ_TX_INT_ENABLE"];

can2.interruptFlags        = ["CAN_INT_ERROR","CAN_INT_IE0","CAN_INT_STATUS"];
can2.interruptLine         = ["CAN_GLOBAL_INT_CANINT0"];
can2.$name                 = "CAN_PUBLIC";
can2.enableInterrupt       = true;
can2.startModule           = false;
can2.registerInterrupts    = true;
can2.can.$assign           = "CANB";
can2.can.can_rxPin.$assign = "GPIO39";
can2.can.can_txPin.$assign = "GPIO38";

cla1.$name              = "myCLA0";
cla1.trigger_CLA_TASK_1 = "CLA_TRIGGER_ADCD1";
cla1.trigger_CLA_TASK_2 = "CLA_TRIGGER_EPWM4INT";

const divider6       = system.clockTree["ECATDIV"];
divider6.divideValue = 4;

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

const multiplier1         = system.clockTree["AUX_IMULT"];
multiplier1.multiplyValue = 50;

const multiplier2         = system.clockTree["PLL_IMULT"];
multiplier2.multiplyValue = 40;

const mux11       = system.clockTree["DIVSRCSEL"];
mux11.inputSelect = "PLLSYSCLK";

const mux18       = system.clockTree["XTAL_OR_X1"];
mux18.inputSelect = "XTAL";

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 20;

epwm1.$name                                                        = "GD_HB_1";
epwm1.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm1.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_polarityFED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmDeadband_delayRED                                        = 800;
epwm1.epwmDeadband_delayFED                                        = 800;
epwm1.epwmEventTrigger_enableInterrupt                             = true;
epwm1.epwmEventTrigger_interruptEventCount                         = "1";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                    = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                    = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar            = "1";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEnable                    = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerSource                    = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar            = "1";
epwm1.epwmTripZone_tzInterruptSource                               = ["EPWM_TZ_INTERRUPT_OST"];
epwm1.epwmTimebase_period                                          = 50000;
epwm1.hrpwm_syncSource                                             = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm1.epwmEventTrigger_interruptSource                             = "EPWM_INT_TBCTR_ZERO";
epwm1.epwmCounterCompare_cmpA                                      = 50000;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmCounterCompare_cmpB                                      = 49400;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_HIGH";
epwm1.epwm.$assign                                                 = "EPWM4";
epwm1.epwm.epwm_aPin.$assign                                       = "GPIO6";
epwm1.epwm.epwm_bPin.$assign                                       = "GPIO7";

epwm2.$name                                                        = "GD_HB_2";
epwm2.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm2.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm2.epwmDeadband_delayRED                                        = 560;
epwm2.epwmDeadband_delayFED                                        = 520;
epwm2.epwmDeadband_polarityFED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmEventTrigger_enableInterrupt                             = true;
epwm2.epwmEventTrigger_registerInterrupts                          = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_HIGH";
epwm2.epwmTimebase_period                                          = 50000;
epwm2.epwmTimebase_phaseEnable                                     = true;
epwm2.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.hrpwm_syncSource                                             = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm2.epwmCounterCompare_cmpA                                      = 50000;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm2.epwmCounterCompare_cmpB                                      = 49400;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwm.$assign                                                 = "EPWM3";
epwm2.epwm.epwm_aPin.$assign                                       = "GPIO4";
epwm2.epwm.epwm_bPin.$assign                                       = "GPIO5";
epwm2.epwmInt.enableInterrupt                                      = true;

epwm3.$name                                                        = "FO_HB_1";
epwm3.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm3.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm3.epwmEventTrigger_enableInterrupt                             = true;
epwm3.epwmEventTrigger_registerInterrupts                          = true;
epwm3.epwmEventTrigger_interruptEventCount                         = "1";
epwm3.epwmEventTrigger_interruptSource                             = "EPWM_INT_TBCTR_PERIOD";
epwm3.epwmDeadband_delayRED                                        = 560;
epwm3.epwmDeadband_delayFED                                        = 520;
epwm3.epwmDeadband_polarityRED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm3.epwmTimebase_period                                          = 50000;
epwm3.epwmTimebase_phaseEnable                                     = true;
epwm3.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.epwmCounterCompare_cmpB                                      = 1;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmCounterCompare_cmpA                                      = 601;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_HIGH";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwm.$assign                                                 = "EPWM8";
epwm3.epwm.epwm_aPin.$assign                                       = "GPIO14";
epwm3.epwm.epwm_bPin.$assign                                       = "GPIO15";
epwm3.epwmInt.enableInterrupt                                      = true;

epwm4.$name                                                        = "FO_HB_2";
epwm4.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm4.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm4.epwmDeadband_delayRED                                        = 560;
epwm4.epwmDeadband_delayFED                                        = 520;
epwm4.epwmEventTrigger_enableInterrupt                             = true;
epwm4.epwmEventTrigger_registerInterrupts                          = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEnable                    = true;
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEnable                    = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar            = "1";
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar            = "1";
epwm4.useCase                                                      = "CUSTOM";
epwm4.epwmTimebase_period                                          = 50000;
epwm4.epwmTimebase_phaseEnable                                     = true;
epwm4.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm4.epwmCounterCompare_cmpB                                      = 1;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm4.epwmCounterCompare_cmpA                                      = 601;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_LOW";
epwm4.useInterfacePins                                             = ["EPWM#A","EPWM#B"];
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_HIGH";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_LOW";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                    = "EPWM_TZ_ACTION_DISABLE";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                    = "EPWM_TZ_ACTION_DISABLE";
epwm4.epwmInt.enableInterrupt                                      = true;
epwm4.epwm.$assign                                                 = "EPWM12";
epwm4.epwm.epwm_aPin.$assign                                       = "GPIO22";
epwm4.epwm.epwm_bPin.$assign                                       = "GPIO23";

