HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/vpu_mvp_board_s.syscfg
gpio39.$name = "myGPIO0";

i2c1.$name                  = "I2C_RTC";
i2c1.duty                   = "I2C_DUTYCYCLE_50";
i2c1.bitCount               = "I2C_BITCOUNT_8";
i2c1.dataCount              = 2;
i2c1.targetAddress          = 0x51;
i2c1.enabledInterrupts      = ["I2C_INT_ADDR_TARGET","I2C_INT_ARB_LOST","I2C_INT_NO_ACK","I2C_INT_STOP_CONDITION"];
i2c1.emulationMode          = "I2C_EMULATION_FREE_RUN";
i2c1.i2c.$assign            = "I2CA";
i2c1.i2c.i2c_sdaPin.$assign = "GPIO0";
i2c1.i2c.i2c_sclPin.$assign = "GPIO1";
i2c1.sdaQual.padConfig      = "STD";
i2c1.sclQual.padConfig      = "STD";

gpio11.xint.inputxbar          = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO40";
inputxbar_input1.$name         = "RTD_DRDYA_Input_XBar";

gpio12.xint.inputxbar          = inputxbar_input2;
inputxbar_input2.inputxbarGpio = "GPIO41";
inputxbar_input2.$name         = "RTD_DRDYB_Input_XBar";

inputxbar_input3.$name         = "Input_XBar_HALT_1";
inputxbar_input3.inputxbarGpio = "GPIO47";

inputxbar_input4.inputxbarInput = "XBAR_INPUT2";
inputxbar_input4.$name          = "Input_XBar_HATL_2";
inputxbar_input4.inputxbarGpio  = "GPIO42";

memcfg.init_MEMCFG_SECT_MSGCPUTOCPU1 = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCM0  = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCM1  = true;
memcfg.config_MEMCFG_SECT_LS6        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS7        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS5        = "CLA_data";
memcfg.init_MEMCFG_SECT_MSGCPUTOCPU0 = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;

spi1.$name                    = "RTD_SPI";
spi1.useCase                  = "CUSTOM";
spi1.useInterfacePins         = ["SPI@_CLK","SPI@_SIMO","SPI@_SOMI"];
spi1.mode                     = "SPI_MODE_CONTROLLER";
spi1.registerInterrupts       = true;
spi1.enabledInterrupts        = ["SPI_INT_RX_DATA_TX_EMPTY"];
spi1.useFifo                  = false;
spi1.emulationMode            = "SPI_EMULATION_STOP_AFTER_TRANSMIT";
spi1.spi.$assign              = "SPIA";
spi1.spi.spi_picoPin.$assign  = "GPIO32";
spi1.spi.spi_pociPin.$assign  = "GPIO33";
spi1.spi.spi_clkPin.$assign   = "GPIO34";
spi1.spiRXInt.enableInterrupt = true;
spi1.spiTXInt.enableInterrupt = true;

spi2.$name                   = "SBC_SPI";
spi2.spi.$assign             = "SPIB";
spi2.spi.spi_picoPin.$assign = "GPIO60";
spi2.spi.spi_pociPin.$assign = "GPIO61";
spi2.spi.spi_clkPin.$assign  = "GPIO58";
spi2.spi.spi_ptePin.$assign  = "GPIO59";

spi3.$name                   = "SD_SPI";
spi3.transferProtocol        = "SPI_PROT_POL0PHA1";
spi3.mode                    = "SPI_MODE_CONTROLLER";
spi3.useCase                 = "CUSTOM";
spi3.useInterfacePins        = ["SPI@_CLK","SPI@_SIMO","SPI@_SOMI"];
spi3.spi.$assign             = "SPIC";
spi3.spi.spi_picoPin.$assign = "GPIO69";
spi3.spi.spi_pociPin.$assign = "GPIO70";
spi3.spi.spi_clkPin.$assign  = "GPIO71";

sync.syncOutSource = "SYSCTL_SYNC_OUT_SRC_EPWM4SYNCOUT";

sysctl.sharedPeripheralAllocate_SYSCTL_PALLOCATE_MCAN_A = true;
sysctl.sharedPeripheralAllocate_SYSCTL_PALLOCATE_CAN_B  = true;

FREERTOS1.$name                    = "myFREERTOS0";
FREERTOS1.CPU_CLOCK_HZ             = 200000000;
FREERTOS1.MAX_PRIORITIES           = 32;
FREERTOS1.MINIMAL_STACK_SIZE       = 256;
FREERTOS1.MAX_TASK_NAME_LEN        = 10;
FREERTOS1.USE_TICK_HOOK            = true;
FREERTOS1.CHECK_FOR_STACK_OVERFLOW = 2;
FREERTOS1.USE_MALLOC_FAILED_HOOK   = true;

FPUfastRTS1.$name = "myFFR0";

CMD.activateCMD = true;
CMD.activeCMD   = "CMD_Config";

CMD1.$name                                 = "CMD_Config";
CMD1.sectionMemory_codestart               = "0x080000";
CMD1.sectionMemory_text                    = ["FLASH1","FLASH2","FLASH3","FLASH4"];
CMD1.sectionAlignEnable_text               = true;
CMD1.sectionMemory_ramfunc                 = ["FLASH3"];
CMD1.sectionAlignEnable_ramfunc            = true;
CMD1.sectionRunFromDifferentAddr_ramfunc   = true;
CMD1.sectionRun_ramfunc                    = ["RAMLS0_4"];
CMD1.sectionBinit_ramfunc                  = false;
CMD1.sectionMemory_binit                   = ["FLASH4"];
CMD1.sectionAlignEnable_binit              = true;
CMD1.sectionMemory_ovly                    = ["FLASH0"];
CMD1.sectionAlignEnable_ovly               = true;
CMD1.sectionMemory_cinit                   = ["FLASH4"];
CMD1.sectionAlignEnable_cinit              = true;
CMD1.sectionMemory_stack                   = ["RAMM1"];
CMD1.sectionMemory_init_array              = ["FLASH1"];
CMD1.sectionAlignEnable_init_array         = true;
CMD1.sectionMemory_bss                     = ["RAMLS0_4"];
CMD1.sectionMemory_const                   = ["FLASH5"];
CMD1.sectionAlignEnable_const              = true;
CMD1.sectionMemory_data                    = ["RAMLS0_4"];
CMD1.sectionMemory_switch                  = ["FLASH1"];
CMD1.sectionAlignEnable_switch             = true;
CMD1.sectionMemory_sysmem                  = ["RAMLS0_4"];
CMD1.sectionMemory_cla1Prog                = ["FLASH13"];
CMD1.sectionRunFromDifferentAddr_cla1Prog  = true;
CMD1.sectionBinit_cla1Prog                 = false;
CMD1.sectionAlignEnable_cla1Prog           = true;
CMD1.sectionRun_cla1Prog                   = ["RAMLS6_7"];
CMD1.sectionMemory_claConst                = ["FLASH13"];
CMD1.sectionRunFromDifferentAddr_claConst  = true;
CMD1.sectionRun_claConst                   = ["RAMLS5"];
CMD1.sectionAlignEnable_claConst           = true;
CMD1.sectionMemory_claScratchpad           = ["RAMLS5"];
CMD1.sectionMemory_bssCla                  = ["RAMLS5"];
CMD1.sectionMemory_cla1ToCpuMsgRAM         = ["CLATOCPU_MSGRAM"];
CMD1.sectionMemory_cpuToCla1MsgRAM         = ["CPUTOCLA_MSGRAM"];
CMD1.RAMLSmemoryCombination.create(2);
CMD1.RAMLSmemoryCombination[0].$name       = "RAMLS0_4";
CMD1.RAMLSmemoryCombination[0].combination = ["RAMLS0","RAMLS1","RAMLS2","RAMLS3","RAMLS4"];
CMD1.RAMLSmemoryCombination[1].$name       = "RAMLS6_7";
CMD1.RAMLSmemoryCombination[1].combination = ["RAMLS6","RAMLS7"];
CMD1.userSection.create(3);
CMD1.userSection[0].$name                  = "freertos_stack_mem";
CMD1.userSection[0].sectionName            = ".freertosStaticStack";
CMD1.userSection[0].sectionMemory          = ["RAMLS0_4"];
CMD1.userSection[1].$name                  = "cla_memory_cpu_init_mem";
CMD1.userSection[1].sectionName            = "cla_memory_cpu_init";
CMD1.userSection[1].sectionMemory          = ["RAMLS5"];
CMD1.userSection[2].$name                  = "freertos_heap_mem";
CMD1.userSection[2].sectionName            = ".freertosHeap";
CMD1.userSection[2].sectionMemory          = ["RAMLS0_4"];
scripting.suppress("Memcfg module must be enabled for complete error checking\\.", CMD1, "sectionMemory_cpuToCla1MsgRAM");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio39.gpioPin.$suggestSolution = "GPIO10";
